# Grouping and Aggregation

In [1]:
import pandas as pd

In this notebook we will group the dataframes we made in the previous notebook and join them in order to prepare them for data visualization.

In [2]:
pitching_last_decade = pd.read_pickle('/home/jnogle/finalproject/dataframes/pitching_last_decade')

In [3]:
pitching_post_last_decade = pd.read_pickle('/home/jnogle/finalproject/dataframes/pitching_post_last_decade')

In [4]:
batting_last_decade = pd.read_pickle('/home/jnogle/finalproject/dataframes/batting_last_decade')

In [5]:
batting_post_last_decade = pd.read_pickle('/home/jnogle/finalproject/dataframes/batting_post_last_decade')

In [6]:
fielding_last_decade = pd.read_pickle('/home/jnogle/finalproject/dataframes/fielding_last_decade')

In [7]:
fielding_post_last_decade = pd.read_pickle('/home/jnogle/finalproject/dataframes/fielding_post_last_decade')

In [8]:
team_last_decade = pd.read_pickle('/home/jnogle/finalproject/dataframes/team_last_decade')

## Pitching

In [9]:
pitching_last_decade.head()

       player_id  year team_id   era
32900  abbotpa01  2000     SEA  4.22
32901  aceveju01  2000     MIL  3.81
32902  adamste01  2000     LAN  3.52
32903  aguilri01  2000     CHN  4.91
32904  aldresc01  2000     PHI  5.75

In [10]:
pitching_post_last_decade.head()

      player_id  year round team_id  era
2788  choatra01  2000  ALCS     NYA  0.0
2789  clemero02  2000  ALCS     NYA  0.0
2790   coneda01  2000  ALCS     NYA  0.0
2791  goodedw01  2000  ALCS     NYA  0.0
2792  grimsja01  2000  ALCS     NYA  0.0

In [12]:
group_pitching_last_decade = pitching_last_decade.groupby(['team_id','year'],as_index=False)['era'].aggregate('mean')
group_pitching_last_decade.head()

  team_id  year       era
0     ANA  2000  5.384400
1     ANA  2001  4.181667
2     ANA  2002  3.425556
3     ANA  2003  4.938421
4     ANA  2004  4.901875

The above dataframe contains the average ERA per pitcher by team and year in the regular season.

In [13]:
group_pitching_post_last_decade = pitching_post_last_decade.groupby(['team_id','year'],as_index=False)['era'].aggregate('mean')
group_pitching_post_last_decade.head()

  team_id  year        era
0     ANA  2002   5.655000
1     ANA  2004   5.394286
2     ARI  2001   5.511250
3     ARI  2002  10.817778
4     ARI  2007   1.976471

The above dataframe containts the average ERA per pitcher by team and year in the postseason.

## Batting

In [14]:
batting_last_decade.head()

       player_id  year team_id        ba
79248  abbotje01  2000     CHA  0.274419
79249  abbotku01  2000     NYN  0.216561
79250  abbotpa01  2000     SEA  0.400000
79251  abreubo01  2000     PHI  0.315972
79252  aceveju01  2000     MIL  0.000000

In [15]:
batting_post_last_decade.head()

      year round  player_id team_id        ba
6982  2000  ALCS   bellda01     SEA  0.222222
6984  2000  ALCS  brosisc01     NYA  0.222222
6985  2000  ALCS  buhneja01     SEA  0.181818
6986  2000  ALCS  camermi01     SEA  0.111111
6988  2000  ALCS  guillca01     SEA  0.200000

In [16]:
group_batting_last_decade = batting_last_decade.groupby(['team_id','year'],as_index=False)['ba'].aggregate('mean')
group_batting_last_decade.head()

  team_id  year        ba
0     ANA  2000  0.271819
1     ANA  2001  0.227313
2     ANA  2002  0.233663
3     ANA  2003  0.220090
4     ANA  2004  0.195324

The above dataframe contains the  Batting Average per team by team and year during the regular season.

In [17]:
group_batting_post_last_decade = batting_post_last_decade.groupby(['team_id','year'],as_index=False)['ba'].aggregate('mean')
group_batting_post_last_decade.head()

  team_id  year        ba
0     ANA  2002  0.316314
1     ANA  2004  0.176532
2     ARI  2001  0.202463
3     ARI  2002  0.156623
4     ARI  2007  0.259489

The above dataframe contains the Batting Average per player by team and year during the postseason.

## Fielding

In [18]:
fielding_last_decade.head()

        player_id  year team_id league_id    e
132441  abbotje01  2000     CHA        AL  2.0
132443  abbotku01  2000     NYN        NL  1.0
132444  abbotku01  2000     NYN        NL  0.0
132446  abbotku01  2000     NYN        NL  0.0
132447  abbotku01  2000     NYN        NL  6.0

In [19]:
fielding_post_last_decade.head()

      player_id  year team_id league_id round  g  e
7068  bellicl01  2000     NYA        AL  ALCS  5  0
7069  brosisc01  2000     NYA        AL  ALCS  6  1
7070  choatra01  2000     NYA        AL  ALCS  1  0
7071  clemero02  2000     NYA        AL  ALCS  1  0
7072   coneda01  2000     NYA        AL  ALCS  1  0

In [20]:
group_fielding_last_decade = fielding_last_decade.groupby(['team_id','year'],as_index=False)['e'].aggregate('mean')
group_fielding_last_decade.head()

  team_id  year         e
0     ANA  2000  2.310345
1     ANA  2001  1.943396
2     ANA  2002  1.611111
3     ANA  2003  1.750000
4     ANA  2004  1.730769

The above dataframe contains the average number of errors per player by team and year during the regular season.

In [21]:
group_fielding_post_last_decade = fielding_post_last_decade.groupby(['team_id','year'],as_index=False)['e'].aggregate('mean')
group_fielding_post_last_decade.head()

  team_id  year         e
0     ANA  2002  0.145161
1     ANA  2004  0.150000
2     ARI  2001  0.149254
3     ARI  2002  0.083333
4     ARI  2007  0.150000

The above dataframe contains the average number of errors per player by team and year during the postseason.

## Merging

In [22]:
a = pd.merge(group_fielding_last_decade,group_batting_last_decade)

In [23]:
b = pd.merge(a,group_pitching_last_decade)
b.head()

  team_id  year         e        ba       era
0     ANA  2000  2.310345  0.271819  5.384400
1     ANA  2001  1.943396  0.227313  4.181667
2     ANA  2002  1.611111  0.233663  3.425556
3     ANA  2003  1.750000  0.220090  4.938421
4     ANA  2004  1.730769  0.195324  4.901875

In [24]:
team_last_decade.head()

      year team_id div_id  rank    g   w ws_win                  name
2325  2000     ANA      W     3  162  82      N        Anaheim Angels
2326  2000     ARI      W     3  162  85      N  Arizona Diamondbacks
2327  2000     ATL      E     1  162  95      N        Atlanta Braves
2328  2000     BAL      E     4  162  74      N     Baltimore Orioles
2329  2000     BOS      E     2  162  85      N        Boston Red Sox

In [25]:
grouped = pd.merge(team_last_decade, b)
grouped.head()

,year,team_id,div_id,rank,g,w,ws_win,name,e,ba,era
0,2000,ANA,W,3,162,82,N,Anaheim Angels,2.310345,0.271819,5.384400
1,2000,ARI,W,3,162,85,N,Arizona Diamondbacks,1.945455,0.247616,5.310000
2,2000,ATL,E,1,162,95,N,Atlanta Braves,2.388889,0.184948,5.575909
3,2000,BAL,E,4,162,74,N,Baltimore Orioles,1.966102,0.202421,6.768636
4,2000,BOS,E,2,162,85,N,Boston Red Sox,1.651515,0.207478,5.046667

The above dataframe has combined all the dataframes we needed, grouped by team and year to analyze performance during the regular season.

In [26]:
grouped.to_pickle('grouped')

In [27]:
c = pd.merge(group_fielding_post_last_decade,group_batting_post_last_decade)

In [28]:
d = pd.merge(c,group_pitching_post_last_decade)

In [29]:
grouped_post = pd.merge(team_last_decade, d)
grouped_post.head()

,year,team_id,div_id,rank,g,w,ws_win,name,e,ba,era
0,2000,ATL,E,1,162,95,N,Atlanta Braves,0.238095,0.175931,7.628889
1,2000,CHA,C,1,162,95,N,Chicago White Sox,0.086957,0.173783,3.856667
2,2000,NYA,E,1,161,87,Y,New York Yankees,0.081967,0.267127,3.004583
3,2000,NYN,E,2,162,94,N,New York Mets,0.123288,0.182100,3.388621
4,2000,OAK,W,1,161,91,N,Oakland Athletics,0.200000,0.323959,2.360000

The above dataframe has combined all the dataframes we needed, grouped by team and year to analyze performance during the postseason.

In [30]:
grouped_post.to_pickle('grouped_post')